SF/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/ABLConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $flowVelocity;

boundaryField
{
    #include    "include/ABLConditions"

    inletOutlet
    {
        type            atmBoundaryLayerInletVelocity;
        #include        "include/ABLConditions"
    }
    top
    {
        type            atmBoundaryLayerInletVelocity;
        #include        "include/ABLConditions"
    }
    Buildings
    {
        type            uniformFixedValue;
        uniformValue    constant (0 0 0);
        value           uniform (0 0 0);
    }
    Water
    {
        type            uniformFixedValue;
        uniformValue    constant (0 0 0);
        value           uniform (0 0 0);
    }
    Terrain
    {
        type            uniformFixedValue;
        uniformValue    constant (0 0 0);
        value           uniform (0 0 0);
    }
    Vegetation
    {
        type            uniformFixedValue;
        uniformValue    constant (0 0 0);
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
