SF/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #include    "include/ABLConditions"

    inletOutlet
    {
        type            calculated;
        value           uniform 0;
    }
    top
    {
        type            calculated;
        value           uniform 0;
    }
    Buildings
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
    Water
    {
        #include        "include/ABLConditions"
        type            nutkAtmRoughWallFunction;
        z0              $z0_Water;
        value           uniform 0.0;
    }
    Terrain
    {
        #include        "include/ABLConditions"
        type            nutkAtmRoughWallFunction;
        z0              $z0;
        value           uniform 0.0;
    }
    Vegetation
    {
        #include        "include/ABLConditions"
        type            nutkAtmRoughWallFunction;
        z0              $z0_Vegetation;
        value           uniform 0.0;
    }
}


// ************************************************************************* //
