SF/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/ABLConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    #include    "include/ABLConditions"

    inletOutlet
    {
        type            freestreamPressure;
        freestreamValue uniform $pressure;
        supersonic      0;
        value           uniform $pressure;
    }
    top
    {
        type            freestreamPressure;
        freestreamValue uniform $pressure;
        supersonic      0;
        value           uniform $pressure;
    }
    Buildings
    {
        type            zeroGradient;
    }
    Water
    {
        type            zeroGradient;
    }
    Terrain
    {
        type            zeroGradient;
    }
    Vegetation
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
