SF/system/probes
probes
{
    type            probes;
    functionObjectLibs ("libsampling.so");
    outputControl   timeStep;
    outputInterval  1;

    probeLocations
    (
        // Z = 670.0 level (34 points)
        (600.0 -320.0 670.0)
        (-425.0 -70.0 670.0)
        (230.0 235.0 670.0)
        (-420.0 70.0 670.0)
        (45.0 400.0 670.0)
        (320.0 -20.0 670.0)
        (-550.0 220.0 670.0)
        (-120.0 -710.0 670.0)
        (-545.0 -640.0 670.0)
        (-430.0 20.0 670.0)
        (200.0 -575.0 670.0)
        (-220.0 -545.0 670.0)
        (-335.0 -270.0 670.0)
        (-510.0 240.0 670.0)
        (535.0 710.0 670.0)
        (-380.0 -135.0 670.0)
        (70.0 670.0 670.0)
        (110.0 90.0 670.0)
        (-640.0 560.0 670.0)
        (-355.0 -330.0 670.0)
        (-130.0 -630.0 670.0)
        (-660.0 350.0 670.0)
        (360.0 450.0 670.0)
        (705.0 205.0 670.0)
        (-225.0 -35.0 670.0)
        (-160.0 140.0 670.0)
        (610.0 -315.0 670.0)
        (-435.0 -65.0 670.0)
        (235.0 230.0 670.0)
        (-415.0 75.0 670.0)
        (50.0 395.0 670.0)
        (315.0 -25.0 670.0)
        (-545.0 225.0 670.0)
        (-115.0 -715.0 670.0)

        // Z = 700.0 level (33 points)
        (325.0 -260.0 700.0)
        (375.0 -130.0 700.0)
        (515.0 -545.0 700.0)
        (-700.0 400.0 700.0)
        (-10.0 350.0 700.0)
        (170.0 585.0 700.0)
        (645.0 495.0 700.0)
        (505.0 340.0 700.0)
        (-15.0 400.0 700.0)
        (-650.0 685.0 700.0)
        (-175.0 -230.0 700.0)
        (-620.0 485.0 700.0)
        (-20.0 -600.0 700.0)
        (-495.0 580.0 700.0)
        (690.0 100.0 700.0)
        (185.0 -695.0 700.0)
        (580.0 -115.0 700.0)
        (-280.0 200.0 700.0)
        (-190.0 -700.0 700.0)
        (-490.0 -260.0 700.0)
        (330.0 -240.0 700.0)
        (225.0 165.0 700.0)
        (-250.0 -170.0 700.0)
        (390.0 -230.0 700.0)
        (525.0 -335.0 700.0)
        (-105.0 340.0 700.0)
        (320.0 -255.0 700.0)
        (365.0 -135.0 700.0)
        (505.0 -550.0 700.0)
        (-710.0 405.0 700.0)
        (-5.0 345.0 700.0)
        (165.0 590.0 700.0)
        (640.0 490.0 700.0)

        // Z = 730.0 level (33 points)
        (1300.0 265.0 730.0)
        (1280.0 -410.0 730.0)
        (-830.0 995.0 730.0)
        (-1080.0 -345.0 730.0)
        (-1245.0 105.0 730.0)
        (-1200.0 10.0 730.0)
        (170.0 1375.0 730.0)
        (85.0 -725.0 730.0)
        (-1110.0 1045.0 730.0)
        (470.0 550.0 730.0)
        (370.0 -250.0 730.0)
        (960.0 -1150.0 730.0)
        (440.0 980.0 730.0)
        (-640.0 705.0 730.0)
        (285.0 1070.0 730.0)
        (690.0 -925.0 730.0)
        (1420.0 -590.0 760.0)
        (-240.0 1045.0 760.0)
        (-1400.0 565.0 760.0)
        (485.0 1190.0 760.0)
        (-130.0 -585.0 760.0)
        (-425.0 -1260.0 760.0)
        (400.0 -335.0 760.0)
        (265.0 430.0 760.0)
        (575.0 -315.0 760.0)
        (15.0 -1250.0 760.0)
        (-500.0 -140.0 760.0)
        (1305.0 270.0 730.0)
        (1275.0 -415.0 730.0)
        (-835.0 990.0 730.0)
        (-1085.0 -350.0 730.0)
        (965.0 -1145.0 730.0)
        (445.0 975.0 730.0)
    );


    fields
    (
        U
        p
        k
    );
}
