SF/system/surfaces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/visualization/surfaces.cfg"

surfaces
{
    type            surfaces;
    libs            ("libsampling.so");
    writeControl    writeTime;

    surfaceFormat   raw;
    fields          (U k epsilon);

    interpolationScheme cellPoint;

    surfaces
    (
	sampleSurface_PH
        {
            type             triSurfaceMesh;
            surface          "samplingPH.stl";
	    source           cells
	    interpolation    true;
        }


/*	Terrain_PH
        {
            type             triSurfaceMesh;
            surface          "Terrain_PH.stl";
	    source           insideCells
	    interpolation    true;
        }

        Water_PH
        {
            type             triSurfaceMesh;
            surface          "Water_PH.stl";
	    source           insideCells
	    interpolation    true;
        }

        Vegetation_PH
        {
            type             triSurfaceMesh;
            surface          "Vegetation_PH.stl";
	    source           insideCells
	    interpolation    true;
        }
	*/

    );
}


// ************************************************************************* //
